In [2]:
import numpy as np
import pandas as pd

In [3]:
# Series 생성
s = pd.Series([1,3,5,np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range('20130101',periods=6)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['A','B','C','D'])

In [11]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df

                   A         B         C         D
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-05 -2.222847  0.316455  0.236681 -1.020273
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197

In [13]:
df_dict = pd.DataFrame(
    {'A':1,
     'B':pd.Timestamp('20130101'),
     'C':pd.Series(1,index=list(range(4)),dtype='float32'),
     'D':np.array([3]*4,dtype='int32'),
     'E':pd.Categorical(['test','train','test','train']),
     'F':'str'}
)

In [14]:
df_dict

   A          B    C  D      E    F
0  1 2013-01-01  1.0  3   test  str
1  1 2013-01-01  1.0  3  train  str
2  1 2013-01-01  1.0  3   test  str
3  1 2013-01-01  1.0  3  train  str

### 데이터 확인하기

In [15]:
df.head()

                   A         B         C         D
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-05 -2.222847  0.316455  0.236681 -1.020273

In [16]:
df.tail()

                   A         B         C         D
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-05 -2.222847  0.316455  0.236681 -1.020273
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.values

array([[ 1.18141236,  0.27114059, -0.43571233,  0.86285739],
       [-0.93129088,  0.34737955,  0.09654164, -0.48671486],
       [-1.67086154,  0.05826747, -0.70962279,  0.71687924],
       [ 0.849295  , -1.02030794,  2.84284993, -0.63100882],
       [-2.22284744,  0.31645475,  0.23668092, -1.02027266],
       [-0.92081568, -0.03714904, -1.12405638,  0.81319692]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.619185 -0.010702  0.151113  0.042490
std    1.361230  0.517581  1.411881  0.846749
min   -2.222847 -1.020308 -1.124056 -1.020273
25%   -1.485969 -0.013295 -0.641145 -0.594935
50%   -0.926053  0.164704 -0.169585  0.115082
75%    0.406767  0.305126  0.201646  0.789117
max    1.181412  0.347380  2.842850  0.862857

In [21]:
df_dict.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-01 00:00:00  1.0  3.0
min    1.0  2013-01-01 00:00:00  1.0  3.0
25%    1.0  2013-01-01 00:00:00  1.0  3.0
50%    1.0  2013-01-01 00:00:00  1.0  3.0
75%    1.0  2013-01-01 00:00:00  1.0  3.0
max    1.0  2013-01-01 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.181412   -0.931291   -1.670862    0.849295   -2.222847   -0.920816
B    0.271141    0.347380    0.058267   -1.020308    0.316455   -0.037149
C   -0.435712    0.096542   -0.709623    2.842850    0.236681   -1.124056
D    0.862857   -0.486715    0.716879   -0.631009   -1.020273    0.813197

In [24]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197
2013-01-05 -2.222847  0.316455  0.236681 -1.020273
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-01  1.181412  0.271141 -0.435712  0.862857

In [26]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-05 -2.222847  0.316455  0.236681 -1.020273
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197
2013-01-04  0.849295 -1.020308  2.842850 -0.631009

## 데이터 선택하기

In [27]:
df['A']

2013-01-01    1.181412
2013-01-02   -0.931291
2013-01-03   -1.670862
2013-01-04    0.849295
2013-01-05   -2.222847
2013-01-06   -0.920816
Freq: D, Name: A, dtype: float64

In [28]:
type(df['A'])

pandas.core.series.Series

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879

In [30]:
## 인덱스 명에 해당하는 값
df['2013-01-02':'2013-01-05']

                   A         B         C         D
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879
2013-01-04  0.849295 -1.020308  2.842850 -0.631009
2013-01-05 -2.222847  0.316455  0.236681 -1.020273

In [31]:
df.loc['2013-01-01','A']

1.1814123643123602

In [32]:
df.loc['2013-01-01']

A    1.181412
B    0.271141
C   -0.435712
D    0.862857
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.181412  0.271141
2013-01-02 -0.931291  0.347380
2013-01-03 -1.670862  0.058267
2013-01-04  0.849295 -1.020308
2013-01-05 -2.222847  0.316455
2013-01-06 -0.920816 -0.037149

In [34]:
df[['A','B']]

                   A         B
2013-01-01  1.181412  0.271141
2013-01-02 -0.931291  0.347380
2013-01-03 -1.670862  0.058267
2013-01-04  0.849295 -1.020308
2013-01-05 -2.222847  0.316455
2013-01-06 -0.920816 -0.037149

In [35]:
df.loc[dates[0],'A']

1.1814123643123602

In [37]:
df.iloc[3]

A    0.849295
B   -1.020308
C    2.842850
D   -0.631009
Name: 2013-01-04 00:00:00, dtype: float64

In [38]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.849295 -1.020308
2013-01-05 -2.222847  0.316455

In [39]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.931291  0.096542
2013-01-03 -1.670862 -0.709623
2013-01-05 -2.222847  0.236681

In [40]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.931291  0.347380  0.096542 -0.486715
2013-01-03 -1.670862  0.058267 -0.709623  0.716879

### 조건으로 가져오기

In [42]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  1.181412  0.271141 -0.435712  0.862857
2013-01-04  0.849295 -1.020308  2.842850 -0.631009

In [43]:
df[df>0]

                   A         B         C         D
2013-01-01  1.181412  0.271141       NaN  0.862857
2013-01-02       NaN  0.347380  0.096542       NaN
2013-01-03       NaN  0.058267       NaN  0.716879
2013-01-04  0.849295       NaN  2.842850       NaN
2013-01-05       NaN  0.316455  0.236681       NaN
2013-01-06       NaN       NaN       NaN  0.813197

### isin 함수

In [44]:
df_isin = pd.DataFrame({'A':[1,2,3],'B':['a','b','c']})
df_isin.isin([1,3,12,'a'])

       A      B
0   True   True
1  False  False
2   True  False

In [45]:
df_isin[df_isin['A'].isin([1,2])]

   A  B
0  1  a
1  2  b

In [46]:
# 테이블 복사
df2 = df.copy()

In [48]:
# 새로운 컬럼 E 를 추가
df2['E'] = ['one','one','two','two','three','three']
df2

                   A         B         C         D      E
2013-01-01  1.181412  0.271141 -0.435712  0.862857    one
2013-01-02 -0.931291  0.347380  0.096542 -0.486715    one
2013-01-03 -1.670862  0.058267 -0.709623  0.716879    two
2013-01-04  0.849295 -1.020308  2.842850 -0.631009    two
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  three
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  three

In [49]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D    E
2013-01-03 -1.670862  0.058267 -0.709623  0.716879  two
2013-01-04  0.849295 -1.020308  2.842850 -0.631009  two

In [50]:
df2[~df2['E'].isin(['two','four'])]

                   A         B         C         D      E
2013-01-01  1.181412  0.271141 -0.435712  0.862857    one
2013-01-02 -0.931291  0.347380  0.096542 -0.486715    one
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  three
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  three

### 데이터 변경하기

In [51]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))

In [52]:
df['F'] = s1

In [53]:
df

                   A         B         C         D    F
2013-01-01  1.181412  0.271141 -0.435712  0.862857  NaN
2013-01-02 -0.931291  0.347380  0.096542 -0.486715  1.0
2013-01-03 -1.670862  0.058267 -0.709623  0.716879  2.0
2013-01-04  0.849295 -1.020308  2.842850 -0.631009  3.0
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  5.0

In [56]:
# 0 번째 인덱스, A 컬럼을 0으로 변경
df.loc[dates[0],'A'] = 0

In [57]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.271141 -0.435712  0.862857  NaN
2013-01-02 -0.931291  0.347380  0.096542 -0.486715  1.0
2013-01-03 -1.670862  0.058267 -0.709623  0.716879  2.0
2013-01-04  0.849295 -1.020308  2.842850 -0.631009  3.0
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  5.0

In [59]:
# 0번째 인덱스, 1번째 컬럼을 0으로 변경
df.iloc[0,1] = 0

In [60]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.435712  0.862857  NaN
2013-01-02 -0.931291  0.347380  0.096542 -0.486715  1.0
2013-01-03 -1.670862  0.058267 -0.709623  0.716879  2.0
2013-01-04  0.849295 -1.020308  2.842850 -0.631009  3.0
2013-01-05 -2.222847  0.316455  0.236681 -1.020273  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  0.813197  5.0

In [61]:
df.loc[:,'D'] = np.array([5]*len(df))

In [62]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.435712  5.0  NaN
2013-01-02 -0.931291  0.347380  0.096542  5.0  1.0
2013-01-03 -1.670862  0.058267 -0.709623  5.0  2.0
2013-01-04  0.849295 -1.020308  2.842850  5.0  3.0
2013-01-05 -2.222847  0.316455  0.236681  5.0  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  5.0  5.0

## 결측 데이터

In [65]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E'] = 1

In [66]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.435712  5.0  NaN  1.0
2013-01-02 -0.931291  0.347380  0.096542  5.0  1.0  1.0
2013-01-03 -1.670862  0.058267 -0.709623  5.0  2.0  NaN
2013-01-04  0.849295 -1.020308  2.842850  5.0  3.0  NaN

In [68]:
df1.dropna(how='all')

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.435712  5.0  NaN  1.0
2013-01-02 -0.931291  0.347380  0.096542  5.0  1.0  1.0
2013-01-03 -1.670862  0.058267 -0.709623  5.0  2.0  NaN
2013-01-04  0.849295 -1.020308  2.842850  5.0  3.0  NaN

In [70]:
df1.dropna(how='any')

                   A        B         C    D    F    E
2013-01-02 -0.931291  0.34738  0.096542  5.0  1.0  1.0

In [71]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.435712  5.0  5.0  1.0
2013-01-02 -0.931291  0.347380  0.096542  5.0  1.0  1.0
2013-01-03 -1.670862  0.058267 -0.709623  5.0  2.0  5.0
2013-01-04  0.849295 -1.020308  2.842850  5.0  3.0  5.0

In [72]:
df1.isna()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [73]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

### 연산

In [74]:
df.mean()

A   -0.816087
B   -0.055893
C    0.151113
D    5.000000
F    3.000000
dtype: float64

In [76]:
df.mean(axis=1)

2013-01-01    1.141072
2013-01-02    1.102526
2013-01-03    0.935557
2013-01-04    2.134367
2013-01-05    1.466058
2013-01-06    1.583596
Freq: D, dtype: float64

In [77]:
df.apply(np.cumsum)

                   A         B         C     D     F
2013-01-01  0.000000  0.000000 -0.435712   5.0   NaN
2013-01-02 -0.931291  0.347380 -0.339171  10.0   1.0
2013-01-03 -2.602152  0.405647 -1.048793  15.0   3.0
2013-01-04 -1.752857 -0.614661  1.794056  20.0   6.0
2013-01-05 -3.975705 -0.298206  2.030737  25.0  10.0
2013-01-06 -4.896521 -0.335355  0.906681  30.0  15.0

In [79]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.435712  5.0  NaN
2013-01-02 -0.931291  0.347380  0.096542  5.0  1.0
2013-01-03 -1.670862  0.058267 -0.709623  5.0  2.0
2013-01-04  0.849295 -1.020308  2.842850  5.0  3.0
2013-01-05 -2.222847  0.316455  0.236681  5.0  4.0
2013-01-06 -0.920816 -0.037149 -1.124056  5.0  5.0

In [78]:
df.apply(lambda x : x.max() - x.min())

A    3.072142
B    1.367687
C    3.966906
D    0.000000
F    4.000000
dtype: float64

### Merge

In [80]:
df = pd.DataFrame(np.random.randn(10,4))

In [84]:
# 테스트용 데이터 분리
pieces = [df[:3],df[3:7],df[7:]]
pieces

[          0         1         2         3
 0  1.169662  1.528325  0.007496 -0.889214
 1 -0.062670 -0.199098 -1.248898  1.055190
 2 -0.124601  0.139332  0.374507 -0.511864,
           0         1         2         3
 3  1.989632 -0.325781 -0.813630  0.780820
 4 -1.056564  0.984681 -0.490574 -0.228306
 5  0.726998 -1.146514  0.087705  0.255525
 6 -1.008761  1.782842  0.174564  0.154154,
           0         1         2         3
 7 -1.326815  0.669289  1.114000 -1.266917
 8 -0.265550 -1.467651 -0.839956  0.009126
 9 -0.215915 -1.120958  1.012573  1.439949]

In [85]:
pd.concat(pieces)

          0         1         2         3
0  1.169662  1.528325  0.007496 -0.889214
1 -0.062670 -0.199098 -1.248898  1.055190
2 -0.124601  0.139332  0.374507 -0.511864
3  1.989632 -0.325781 -0.813630  0.780820
4 -1.056564  0.984681 -0.490574 -0.228306
5  0.726998 -1.146514  0.087705  0.255525
6 -1.008761  1.782842  0.174564  0.154154
7 -1.326815  0.669289  1.114000 -1.266917
8 -0.265550 -1.467651 -0.839956  0.009126
9 -0.215915 -1.120958  1.012573  1.439949

In [90]:
# 1 
left =pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})
right =pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})
merged = pd.merge(left,right,how='inner',on='key')

'''
from left
inner join right on left.id = right.id
'''

In [91]:
left

   key  lval
0  foo     1
1  foo     2

In [92]:
right

   key  rval
0  foo     4
1  foo     5

In [93]:
merged

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [94]:
# 2.

left =pd.DataFrame({'key':['foo','var'],'lval':[1,2]})
right =pd.DataFrame({'key':['foo','var'],'rval':[4,5]})
merged = pd.merge(left,right,how='inner',on='key')

In [95]:
left

   key  lval
0  foo     1
1  var     2

In [96]:
right

   key  rval
0  foo     4
1  var     5

In [97]:
merged

   key  lval  rval
0  foo     1     4
1  var     2     5

### Grouping

In [98]:
df = pd.DataFrame({
    'A' : ['foo','bar','foo','bar',
           'foo','bar','foo','foo'],
    'B' : ['one','one','two','three',
           'two','two','one','three'],
    'C':np.random.randn(8),
    'D' : np.random.randn(8)
})

In [99]:
df

     A      B         C         D
0  foo    one  1.038373 -0.413943
1  bar    one -0.285875 -0.937691
2  foo    two -0.607158 -0.094390
3  bar  three  0.758106 -0.580901
4  foo    two  1.273769 -0.596806
5  bar    two -0.042163 -0.356767
6  foo    one -0.257906 -0.520129
7  foo  three  1.216397 -0.006355

In [100]:
df.groupby('A').sum()

                     B         C         D
A
bar        onethreetwo  0.430068 -1.875359
foo  onetwotwoonethree  2.663476 -1.631624

In [101]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.285875 -0.937691
    three  0.758106 -0.580901
    two   -0.042163 -0.356767
foo one    0.780467 -0.934072
    three  1.216397 -0.006355
    two    0.666611 -0.691197

### pivot table

In [103]:
df = pd.DataFrame({
    'A' : ['foo','bar','foo','bar']*3,
    'B' : ['one','one','two','three']*3,
    'C':np.random.randn(12),
    'D' : np.random.randn(12)
})

df

      A      B         C         D
0   foo    one  0.839683 -1.257727
1   bar    one  1.391014  0.613893
2   foo    two  1.215200  1.185856
3   bar  three  1.213195 -2.262739
4   foo    one -0.497520 -0.667137
5   bar    one -0.142172  0.748386
6   foo    two -0.337887 -1.090244
7   bar  three  0.672416 -0.281039
8   foo    one  1.252486 -2.268856
9   bar    one  0.703441  2.256617
10  foo    two  0.771437 -1.330656
11  bar  three -1.068413  0.828491

In [105]:
pd.pivot_table(df,values='D',index=['A','B'],columns='C')

C          -1.068413  -0.497520  -0.337887  -0.142172   0.672416   0.703441  \
A   B
bar one          NaN        NaN        NaN   0.748386        NaN   2.256617
    three   0.828491        NaN        NaN        NaN  -0.281039        NaN
foo one          NaN  -0.667137        NaN        NaN        NaN        NaN
    two          NaN        NaN  -1.090244        NaN        NaN        NaN

C           0.771437   0.839683   1.213195   1.215200   1.252486   1.391014
A   B
bar one          NaN        NaN        NaN        NaN        NaN   0.613893
    three        NaN        NaN  -2.262739        NaN        NaN        NaN
foo one          NaN  -1.257727        NaN        NaN  -2.268856        NaN
    two    -1.330656        NaN        NaN   1.185856        NaN        NaN